# Semana 2 | AceleraDev - DATA SCIENCE

### Manipulando dados

In [2]:
#Importando os pacotes
import pandas as pd #principal framework de manipulação de dados
import numpy as np

In [3]:
#Caso necessite visualizar a documentação de algum pacote basta:
pd?

### Dicionários

In [4]:
#Criando um dicionário com os dados 
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
         'acessos' : [100, 200, 300, 400, 500],
         'site' : ['site1', 'site1', 'site2', 'site2', 'site3'],
         'vendas' : [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#Visualizar o dicionário
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [6]:
#Verificando o tipo do dicionário
type(dados)

dict

In [7]:
#Acessando as chaves do meu dicionário
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [8]:
#Acessando uma chave específica
dados['canal_venda']

['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']

In [9]:
#Acessando uma posição específica do dicionário
dados['canal_venda'][0]

'facebook'

### Listas

In [10]:
#Criando
lista = [200, 200, 300, 800, 200]

In [11]:
#Visualizando
lista

[200, 200, 300, 800, 200]

In [12]:
#Visualzando valores específicos
lista[3]

800

In [13]:
#Visualizar uma fatia da lista
lista[:3]

[200, 200, 300]

In [14]:
#Adicionando a lista ao dicionário
dados['lista'] = lista

In [15]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

### DataFrames

In [16]:
#Criando um DATAFRAME a partir de um DICT
dataframe = pd.DataFrame(dados)

In [17]:
#Visualizando o DF 
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [18]:
#Printando os três primeiros casos do DF
dataframe.head(3)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300

In [19]:
#Verificando o formato do DF
dataframe.shape

(5, 5)

In [20]:
#Verificando o índice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
#Verificando os tipos dos dados do DF
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [22]:
#Verificando se existem dados faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [23]:
#Contando a quantidade de dados faltantes
dataframe.isna().sum()

canal_venda    0
acessos        0
site           0
vendas         0
lista          0
dtype: int64

In [24]:
#Visualizando o nome das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [25]:
#Acessando uma coluna específica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [26]:
#Criando uma nova coluna 
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [27]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [28]:
#Removendo colunas 
dataframe.drop(columns = 'nova_coluna', inplace=True)

In [29]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [30]:
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [31]:
#Acessando valores específicos
dataframe['canal_venda'][2]

'instagram'

In [32]:
#Acessando fatia de coluna específica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [33]:
#Fatiando os dados usando iloc(linha/coluna)
dataframe.iloc[:2, 2:]

    site   vendas  lista
0  site1  1000.52    200
1  site1  1052.34    200

In [34]:
#Fatiar os dados usando o loc(índice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800

In [35]:
#Selecionando colunas específicas
dataframe[['canal_venda', 'acessos']]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [36]:
#Passando os valores como listas
filtro = ['canal_venda', 'acessos']

In [37]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [38]:
#Usando o método info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes

In [39]:
#Pivotando os dados (colunas)
aux = dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos')

In [40]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, facebook to twitter
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   site1   2 non-null      float64
 1   site2   2 non-null      float64
 2   site3   1 non-null      float64
dtypes: float64(3)
memory usage: 128.0+ bytes

In [41]:
#Completando os valores faltantes usando fillna
aux = dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [42]:
#Mudando as colunas usando o método melt 
dataframe.melt(id_vars = 'site', value_vars = ['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [43]:
#Resetando o índice do DF 
print(aux.columns)
aux = aux.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['canal_venda', 'site1', 'site2', 'site3'], dtype='object', name='site')

In [44]:
aux

site canal_venda  site1  site2  site3
0       facebook  100.0    0.0  500.0
1      instagram    0.0  300.0    0.0
2       linkedin    0.0  400.0    0.0
3        twitter  200.0    0.0    0.0

In [45]:
#Exemplo do comando melt
aux.melt(id_vars = 'canal_venda', value_vars = ['site1', 'site2', 'site3'])

   canal_venda   site  value
0     facebook  site1  100.0
1    instagram  site1    0.0
2     linkedin  site1    0.0
3      twitter  site1  200.0
4     facebook  site2    0.0
5    instagram  site2  300.0
6     linkedin  site2  400.0
7      twitter  site2    0.0
8     facebook  site3  500.0
9    instagram  site3    0.0
10    linkedin  site3    0.0
11     twitter  site3    0.0

In [46]:
#Somando as colunas do DF
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
dtype: object

In [47]:
#Somando as linhas do DF
dataframe.sum(axis = 1)

0    1300.52
1    1452.34
2    2602.00
3    6200.00
4    1000.00
dtype: float64

In [48]:
#Calculando a mediana das colunas numéricas
print('Por linha: ', dataframe.median(axis = 1))
print('Por coluna: ', dataframe.median())

Por linha:  0    200.0
1    200.0
2    300.0
3    800.0
4    300.0
dtype: float64
Por coluna:  acessos     300.00
vendas     1052.34
lista       200.00
dtype: float64

In [49]:
#Calculando a média das colunas numéricas
dataframe.mean()

acessos     300.000
vendas     1870.972
lista       340.000
dtype: float64

In [50]:
#Calculando o desvio padrão das colunas numéricas
dataframe.std()

acessos     158.113883
vendas     1850.931024
lista       260.768096
dtype: float64

In [51]:
#calcula estatísticas descritivas para colunas numéricas
dataframe.describe()

          acessos       vendas       lista
count    5.000000     5.000000    5.000000
mean   300.000000  1870.972000  340.000000
std    158.113883  1850.931024  260.768096
min    100.000000   300.000000  200.000000
25%    200.000000  1000.520000  200.000000
50%    300.000000  1052.340000  200.000000
75%    400.000000  2002.000000  300.000000
max    500.000000  5000.000000  800.000000

In [52]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1   300.00  200.0
1         NaN      200  site2  1000.52    NaN
2         NaN      300    NaN  1052.34    NaN
3         NaN      400    NaN  2002.00    NaN
4         NaN      500    NaN  5000.00    NaN

In [53]:
#Valor máximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
dtype: object

In [54]:
#Valor mínimo por coluna 
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
dtype: object

In [55]:
#Printando o número de únicos 
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
dtype: int64

In [56]:
#Contando valores únicos de uma coluna 
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_venda, dtype: int64

In [57]:
#Valores únicos de uma coluna 
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [58]:
#Usando o groupby com valores numéricos
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [59]:
#Usando o groupby com valores numéricos
dataframe.groupby('site')['acessos'].unique()

site
site1    [100, 200]
site2    [300, 400]
site3         [500]
Name: acessos, dtype: object

In [60]:
dataframe.groupby('site')['acessos'].first()

site
site1    100
site2    300
site3    500
Name: acessos, dtype: int64

In [61]:
#Usando groupby com a função agg
dataframe.groupby('canal_venda').agg({'site' : 'unique',
                                     'acessos' : 'sum'})

                       site  acessos
canal_venda
facebook     [site1, site3]      600
instagram           [site2]      300
linkedin            [site2]      400
twitter             [site1]      200

In [62]:
#Correlações entre variáveis
dataframe.corr(method = 'spearman')

         acessos    vendas     lista
acessos  1.00000  0.000000  0.335410
vendas   0.00000  1.000000  0.894427
lista    0.33541  0.894427  1.000000

In [63]:
#Criando variáveis categoricas por fatia de variável numérica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                      bins = (0, 1500, 2000, 8000),
                                      labels = ('0 a 1500', '1500 a 2000', '2000 a 8000'))

In [64]:
dataframe

  canal_venda  acessos   site   vendas  lista categoria_vendas
0    facebook      100  site1  1000.52    200         0 a 1500
1     twitter      200  site1  1052.34    200         0 a 1500
2   instagram      300  site2  2002.00    300      2000 a 8000
3    linkedin      400  site2  5000.00    800      2000 a 8000
4    facebook      500  site3   300.00    200         0 a 1500

In [65]:
#Criando variáveis categóricas usando compressão de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [66]:
dataframe

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

In [67]:
#Juntando dois DF
dataframe_2 = pd.DataFrame({'site' : ['site1', 'site1', 'site2', 'site2', 'site3'],
                            'suporte' : ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [68]:
#Realizando o merge
dataframe.merge(dataframe_2, on = 'site', how = 'left')

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,0 a 1500,maior_que_300,Ezequiel

In [69]:
#Salvando o DF como um arquivo CSV
dataframe.to_csv('dataframe.csv', sep = ';' , decimal = ',' , index = False)

In [70]:
#Lendo dados do arq CSV 
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [71]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,0 a 1500,maior_que_300

### Imputação de dados

In [72]:
df = pd.read_csv('train.csv')

In [86]:
aux = pd.DataFrame({
    'colunas' : df.columns,
    'tipos' : df.dtypes,
    'percentual_faltante' : df.isna().sum() / df.shape[0]
})

In [87]:
aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.000000
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [88]:
#Dados numéricos : média ou mediana
df['Age'] = df['Age'].fillna(df['Age'].median())

In [90]:
aux = pd.DataFrame({
    'colunas' : df.columns,
    'tipos' : df.dtypes,
    'percentual_faltante' : df.isna().sum() / df.shape[0]
})

aux

                 colunas    tipos  percentual_faltante
PassengerId  PassengerId    int64             0.000000
Survived        Survived    int64             0.000000
Pclass            Pclass    int64             0.000000
Name                Name   object             0.000000
Sex                  Sex   object             0.000000
Age                  Age  float64             0.000000
SibSp              SibSp    int64             0.000000
Parch              Parch    int64             0.000000
Ticket            Ticket   object             0.000000
Fare                Fare  float64             0.000000
Cabin              Cabin   object             0.771044
Embarked        Embarked   object             0.002245

In [91]:
#Dados categóricos: Unknown ou moda
df['Cabin'] = df['Cabin'].fillna('Unknown')

In [92]:
df['Cabin'].value_counts()

Unknown        687
C23 C25 C27      4
B96 B98          4
G6               4
C22 C26          3
              ...
E38              1
B38              1
F E69            1
C99              1
D11              1
Name: Cabin, Length: 148, dtype: int64